Tekla.Structures.Drawing.PointPlacingType
The PointPlacingType class defines a placing type where the object is placed
at one point (the insertion point) without any additional placing options.

Tekla.Structures.Drawing.PointPlacingType.#ctor
Creates a new point placing type instance.